# Pandas
### Introduction to data frame...

In [1]:
import pandas as pd

In [2]:
# [[1,2,3],[4,5,6],[7,8,9],[10,11,12]]

pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=['A','B','C'])

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [ ]:
# index name changel and coulum 
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=['A','B','C'], index=['x1','x2','x3','x4'])

# save to df

In [6]:
df

     A   B   C
x1   1   2   3
x2   4   5   6
x3   7   8   9
x4  10  11  12

In [7]:
# want to see only first 4 date
df.head()

     A   B   C
x1   1   2   3
x2   4   5   6
x3   7   8   9
x4  10  11  12

In [ ]:
# tail() for last 5 data
df.tail() #df.tail(2)

     A   B   C
x1   1   2   3
x2   4   5   6
x3   7   8   9
x4  10  11  12

In [ ]:
df.tail(2)

In [9]:
df.columns # it will show column name and object

Index(['A', 'B', 'C'], dtype='object')

In [14]:
# data is indexing want to_list
df.columns.to_list()

['A', 'B', 'C']

In [15]:
# want to indexing 
df.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [16]:
# want ot name indexing to lisht
df.index.to_list

In [ ]:
# give  to information data 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x1 to x4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 300.0+ bytes

In [18]:
# give. to describation of 
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [ ]:
df.nunique() # unique values

A    4
B    4
C    4
dtype: int64

In [20]:
# can apply specific column
df["A"]

x1     1
x2     4
x3     7
x4    10
Name: A, dtype: int64

In [22]:
df["A"].nunique()

4

In [ ]:
df.shape # it gives us columns and rows

(4, 3)

In [ ]:
df.size # it says size

12

In [26]:
df.duplicated ()

x1    False
x2    False
x3    False
x4    False
dtype: bool

## Loading in dataframes from files..

In [28]:
coffee =  pd.read_csv("/Volumes/study/A_data-science/Python/Pandas/data/coffee.csv")

In [32]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [34]:
result = pd.read_parquet("/Volumes/study/A_data-science/Python/Pandas/data/results.parquet")

In [36]:
result.shape

(308408, 11)

In [38]:
result.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [39]:
# loading another csv 
bios = pd.read_csv("/Volumes/study/A_data-science/Python/Pandas/data/bios.csv")

In [40]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [43]:
olympics_data = pd.read_excel("/Volumes/study/A_data-science/Python/Pandas/data/olympics-data.xlsx")

In [44]:
olympics_data.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [45]:
print(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [ ]:
# randomly data provided
coffee.sample()
coffee.sample(5)

          Day Coffee Type  Units Sold
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
4   Wednesday    Espresso          35
11   Saturday       Latte          35

In [57]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [ ]:
# indexing of data 
#loc - only location
#coffee.loc[rows, columns]

coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [59]:
coffee.loc[2]

Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object

coffee.loc[1,"Coffee Type"]

In [67]:
coffee.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [75]:
# iloc - index location
coffee.iloc[0,2] # i means = indexing

np.int64(25)

In [79]:
coffee.iloc[:] # all
coffee.iloc[:1]
coffee.iloc[:2]

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          15

In [ ]:
coffee.iloc[:,[0,2]] # will show columns

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

# other stuff

In [81]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [100]:
# changing index to name convesion
coffee.index = coffee["Day"]
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [101]:
coffee.loc["Monday","Coffee Type"]

Day
Monday    Espresso
Monday       Latte
Name: Coffee Type, dtype: object

In [87]:
coffee.index = coffee["Coffee Type"]
coffee.head()

                   Day Coffee Type  Units Sold
Coffee Type
Espresso        Monday    Espresso          25
Latte           Monday       Latte          15
Espresso       Tuesday    Espresso          30
Latte          Tuesday       Latte          20
Espresso     Wednesday    Espresso          35

In [103]:
# Setting values 

# sel values in colum
coffee = pd.read_csv("data/coffee.csv")
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [105]:
# change the values 
coffee.loc[1:3,"Units Sold"] =10
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [ ]:
coffee.Day # only one word

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [ ]:
coffee['Coffee Type'] # when two or more words

0     Espresso
1        Latte
2     Espresso
3        Latte
4     Espresso
5        Latte
6     Espresso
7        Latte
8     Espresso
9        Latte
10    Espresso
11       Latte
12    Espresso
13       Latte
Name: Coffee Type, dtype: object

In [ ]:
# seriose 1d array

In [ ]:
## Sort the data  ascending = True or decending 
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [ ]:
coffee.sort_values(["Units Sold"], ascending = True) # ascending means from small to big
coffee.sort_values(["Units Sold"], ascending = False) # Deascending means from big to small

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10

In [115]:
# Adding two column for ascending and decending 
coffee.sort_values(["Units Sold"], ascending = True) # ascending means from small to big
coffee.sort_values(["Units Sold","Coffee Type"], ascending = [1,0]) # Deascending means from big to small

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          10
2     Tuesday    Espresso          10
5   Wednesday       Latte          25
0      Monday    Espresso          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

## iterate over dataFrame

In [116]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [118]:
for index, row in coffee.iterrows():
    print(f"Index :{index}")
    print(f"Row Data :\n{row}")
    print(f"Coffee Type : {row['Coffee Type']}")
    print("--------------------------")

Index :0
Row Data :
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object
Coffee Type : Espresso
--------------------------
Index :1
Row Data :
Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object
Coffee Type : Latte
--------------------------
Index :2
Row Data :
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object
Coffee Type : Espresso
--------------------------
Index :3
Row Data :
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object
Coffee Type : Latte
--------------------------
Index :4
Row Data :
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object
Coffee Type : Espresso
--------------------------
Index :5
Row Data :
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
Coffee Type : Latte
--------------------------
Index :6
Row Data :
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
Coffee Type : Espresso
--------------------------
Index :7
Row Data :
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
Coffee Type : Latte
--------------------------
Index :8
Row Data :
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
Coffee Type : Espresso
--------------------------
Index :9
Row Data :
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
Coffee Type : Latte
--------------------------
Index :10
Row Data :
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
Coffee Type : Espresso
--------------------------
Index :11
Row Data :
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
Coffee Type : Latte
--------------------------
Index :12
Row Data :
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object
Coffee Type : Espresso
--------------------------
Index :13
Row Data :
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object
Coffee Type : Latte
--------------------------